import Roles from "./Roles";
const DataBase = {
    usersCredentials: [
        {
            username: "teacherElena",
            password: "teacherElena",
        },
        {
            username: "studentXenia",
            password: "studentXenia",
        },
    ],

    users: [
        {
            username: "teacherElena",
            firstName: "Присакарь",
            lastName: "Елена",
            patronymic: "Олеговная",
            sex: "Женский",
            birthday: "12.08.2001",
            bornPlace: "Бельцы",
            address: "Бельцы",
            ethnicity: "Молдованка",
            role: Roles.Teacher,
            image: "lenuta.svg",
        },
        {
            username: "studentXenia",
            firstName: "Комаровская",
            lastName: "Ксения",
            patronymic: "Олеговная",
            sex: "Женский",
            birthday: "12.08.2007",
            bornPlace: "Бельцы",
            address: "Бельцы",
            ethnicity: "Молдованка",
            role: Roles.Student,
            image: "",
            class: "8b",
        },
    ],

    schelduleTeacher: {
        teacherElena: [
            ["7A", "7Б (замена)", "8Б", "9Б", "5А (замена)", "11Б"],
            ["8A", "8Б (замена)", "9Б", "10Б", "6А (замена)", "12Б"],
            ["9A", "9Б (замена)", "10Б", "11Б", "7А (замена)"],
            ["6A", "6Б", "8Б", "9Б", "5А", "11Б"],
            ["4A", "4Б", "7Б", "8Б", "4А", "10Б"],
            ["6A", "6Б", "8Б"],
            [],
        ],
    },

    schelduleStudent: {
        "8b": [
            ["Информатика", "Английский язык", "Физкультура", "Русский язык", "Литература", "ИЗО", "Немецкий язык"],
            ["География", "Алгебра", "Геометрия", "Биология", "Обществознание", "Физкультура"],
            ["Немецкий язык", "Русский язык", "Литература", "География", "Английский язык", "Физика", "Инд. проект"],
            ["Химия", "Физика", "Русский язык", "Алгебра", "Геометрия", "Английский язык", "История"],
            ["Алгебра", "Геометрия", "Биология", "Химия", "История", "Английский язык"],
            ["Алгебра", "Геометрия", "Классный час"],
            [],
        ],
    },

    availableCourses: {
        teacherElena: [
            {
                name: "Приемы коррекции дисграфии у детей с ОВЗ с использованием интерактивных технологий",
                date: "22 марта 2023",
                auditory: "логопеды, дефектологи",
                administrator: 'Портал для детских специалистов и родителей "Мерсибо"',
                link: "https://mersibo.ru/",
                type: "Вебинар",
                format: "Дистанционный",
                volume: "2 часа",
                cost: 0,
                logo: "mersibo.png",
            },
            {
                name: "Дистанционное обучение: использование социальных сетей и виртуальной обучающей среды в образовании",
                date: "30 марта 2023",
                auditory: "Все педагоги",
                administrator: "Высшая школа делового администрирования",
                link: "https://s-ba.ru/",
                type: "Семинар",
                format: "Дистанционный",
                volume: "9 часов",
                cost: 0,
                logo: "vsda.jpg",
            },
        ],
    },
};

export { DataBase };
